[
    {
        "_id": 1,
        "name": "Arrma RS",
        "sub_category": "Sports",
        "price": 29.99,
        "seller_name": "John Doe",
        "seller_email": "john@gmail.com",
        "rating": 4.5,
        "quantity": 100,
        "description": "Experience the thrill of speed with the Arrma RS sports car. This sleek and powerful toy car is perfect for racing enthusiasts. With its aerodynamic design and high-performance features, it offers exceptional speed and handling. The Arrma RS toy car is built with precision and attention to detail, ensuring a realistic and exciting racing experience. Whether you're racing against friends or performing daring stunts, the Arrma RS will take your racing adventures to the next level.",
        "image_url": "https://i.ibb.co/nfnNbVc/ARRMA-RC-sports.jpg"
    },
    {
        "_id": 2,
        "name": "Buggatti Veyron",
        "sub_category": "Sports",
        "price": 39.99,
        "seller_name": "Jane Smith",
        "seller_email": "jane@gmail.com",
        "rating": 4.8,
        "quantity": 50,
        "description": "Get ready to zoom with the Buggatti Veyron toy sports car. With its sleek design and high-performance features, it's a must-have for car enthusiasts. The Buggatti Veyron toy car is meticulously crafted to replicate the iconic sports car, from its distinctive shape to its luxurious interior. It features smooth-rolling wheels for seamless racing action and is built to withstand hours of play. Whether you're a collector or a young racing enthusiast, the Buggatti Veyron toy car will ignite your passion for speed and style.",
        "image_url": "https://i.ibb.co/37pzycx/Bugatti-Veyron-sports.jpg"
    },
    {
        "_id": 3,
        "name": "Ford Mustang",
        "sub_category": "Sports",
        "price": 24.99,
        "seller_name": "David Johnson",
        "seller_email": "davidjohnson@example.com",
        "rating": 4.2,
        "quantity": 80,
        "description": "Rev up the excitement with the Ford Mustang toy sports car. This iconic vehicle is built for speed and will provide endless fun for young racers. The Ford Mustang toy car features a classic design, complete with racing stripes and realistic detailing. Its sturdy construction ensures durability during intense racing action, while its smooth wheels allow for easy maneuverability. Get behind the wheel of the Ford Mustang and experience the thrill of racing as you compete against friends or create your own racing adventures.",
        "image_url": "https://i.ibb.co/LPv85k3/Ford-Mustang-sports.jpg"
    },
    {
        "_id": 4,
        "name": "Hot Wheels Marvel Spider",
        "sub_category": "Sports",
        "price": 9.99,
        "seller_name": "Emily Davis",
        "seller_email": "emilydavis@example.com",
        "rating": 4.7,
        "quantity": 102,
        "description": "Unleash your favorite superhero's powers with the Hot Wheels Marvel Spider toy sports car. Swing into action and save the day! This toy car features a unique design inspired by the popular Marvel character, Spider-Man. It's adorned with Spider-Man graphics and colors, making it a must-have for fans of the web-slinging hero. The Hot Wheels Marvel Spider toy car is built for speed and agility, allowing it to race through imaginary cityscapes and perform daring stunts. Its sleek and aerodynamic design ensures smooth and fast movements, while the durable construction ensures it can withstand the most thrilling adventures. Whether you're recreating scenes from the Marvel universe or inventing your own superhero stories, the Hot Wheels Marvel Spider toy car is the perfect companion for young heroes-in-training. Get ready to embark on exciting missions and let your imagination soar with this action-packed toy car",
        "image_url": "https://i.ibb.co/bLzSMdm/Hot-Wheels-Marvel-Spider-sports.jpg"
    },
    {
        "_id": 5,
        "name": "Dikei Ford",
        "sub_category": "Police",
        "price": 29.99,
        "seller_name": "John Doe",
        "seller_email": "john@gmail.com",
        "rating": 4.5,
        "quantity": 100,
        "description": "Experience the thrill of speed with the Dikei Ford sports car. This sleek and powerful toy car features a realistic design with aerodynamic curves and stylish details. It is built for high-performance racing and is perfect for young car enthusiasts who love the excitement of fast cars. The Dikei Ford toy car is made from durable materials to withstand intense play, and its smooth wheels ensure easy maneuverability. Get ready for endless racing adventures with the Dikei Ford!",
        "image_url": "https://i.ibb.co/vz8DQvz/Dickie-ford-police.jpg"
    },
    {
        "_id": 6,
        "name": "Kingsmart Police",
        "sub_category": "Police",
        "price": 24.99,
        "seller_name": "Jane Smith",
        "seller_email": "jane@gmail.com",
        "rating": 4.8,
        "quantity": 50,
        "description": "Enforce the law with the Kingsmart Police toy car. This police cruiser is designed to replicate a real-life police car, complete with flashing lights and realistic siren sounds. It features a sturdy construction and smooth wheels, allowing it to navigate various terrains. The Kingsmart Police toy car also has opening doors for easy access to the interior and a removable police figure. Let your little one unleash their imagination as they embark on thrilling police chase adventures and play the role of a brave police officer.",
        "image_url": "https://i.ibb.co/1fqQXPs/KINGSMART-POLICE.jpg"
    },
    {
        "_id": 7,
        "name": "Micro Police SUV",
        "sub_category": "Police",
        "price": 19.99,
        "seller_name": "David Johnson",
        "seller_email": "davidjohnson@example.com",
        "rating": 4.2,
        "quantity": 80,
        "description": "Patrol the streets with the Micro Police SUV toy car. This police SUV is designed to tackle tough terrains and navigate through imaginary crime scenes. It features a rugged exterior, realistic detailing, and working lights and sirens for an immersive play experience. The Micro Police SUV toy car comes with a removable police figure and additional accessories, allowing kids to create exciting police adventures. With its durable construction and engaging features, it's perfect for young aspiring law enforcement officers.",
        "image_url": "https://i.ibb.co/wByshff/Micro-Police-SUV-police.jpg"
    },
    {
        "_id": 8,
        "name": "New Ray Dodge",
        "sub_category": "Police",
        "price": 14.99,
        "seller_name": "Emily Davis",
        "seller_email": "emilydavis@example.com",
        "rating": 4.7,
        "quantity": 102,
        "description": "Experience the power and style of the New Ray Dodge toy sports car. With its sleek design, bold colors, and authentic detailing, this toy car is a must-have for car enthusiasts. The New Ray Dodge toy car is made from high-quality materials to ensure durability and features smooth wheels for easy rolling. Whether you're staging thrilling races or displaying it in your collection, this toy car will surely impress with its realistic design and attention to detail",
        "image_url": "https://i.ibb.co/51Rg3ss/New-ray-dodge-police.jpg"
    },
    {
        "_id": 9,
        "name": "Dickie Jumbo Fire",
        "sub_category": "Fire Truck",
        "price": 34.99,
        "seller_name": "Michael Anderson",
        "seller_email": "michaelanderson@example.com",
        "rating": 4.6,
        "quantity": 70,
        "description": "Introducing the Dickie Jumbo Fire toy truck, a firefighting hero in a compact size. This toy fire truck is equipped with flashing lights and realistic siren sounds, providing an exciting play experience. It features a sturdy construction, movable ladder, and extendable hose for realistic firefighting action. The Dickie Jumbo Fire toy truck is perfect for imaginative play and teaching children about the importance of fire safety. Get ready to save the day with this fantastic toy fire truck!",
        "image_url": " https://i.ibb.co/4736pYq/Dickie-jumbo-fire-fire.jpg"
    },
    {
        "_id": 10,
        "name": "Dieseney Mickey Fire",
        "sub_category": "Fire Truck",
        "price": 19.99,
        "seller_name": "Sarah Thompson",
        "seller_email": "sarahthompson@example.com",
        "rating": 4.3,
        "quantity": 90,
        "description": "Join Mickey Mouse and his friends on exciting firefighting adventures with the Dieseney Mickey Fire toy truck. This playful toy fire truck features a vibrant design with Mickey Mouse-themed details, making it perfect for Disney fans. It comes with a rotating ladder, extendable hose, and working lights and sounds for an immersive play experience. The Dieseney Mickey Fire toy truck sparks imagination and encourages storytelling while teaching important lessons about fire safety.",
        "image_url": "https://i.ibb.co/GHqLb36/Dieseney-Mickey-fire.jpg"
    },
    {
        "_id": 11,
        "name": "Disney Cast Red Fire",
        "sub_category": "Fire Truck",
        "price": 27.99,
        "seller_name": "Emma Wilson",
        "seller_email": "emmawilson@example.com",
        "rating": 4.7,
        "quantity": 30,
        "description": "Join your favorite Disney characters on thrilling firefighting adventures with the Disney Cast Red Fire toy fire truck. This toy fire truck is designed with vibrant colors and features beloved Disney characters, making it a delightful choice for Disney fans. It comes with a movable ladder, extendable hose, and realistic light and sound effects to enhance the play experience. Let your imagination soar as you join Mickey, Minnie, Donald, and Goofy in saving the day with this magical toy fire truck!",
        "image_url": "https://i.ibb.co/2K7qCX9/Disney-cast-red-fire.jpg"
    },
    {
        "_id": 12,
        "name": "Micro Fire Truck",
        "sub_category": "Fire Truck",
        "price": 14.99,
        "seller_name": "Robert Johnson",
        "seller_email": "robertjohnson@example.com",
        "rating": 4.4,
        "quantity": 60,
        "description": "The Micro Fire Truck is a compact yet powerful firefighting vehicle that is ready to tackle any emergency. It features a detailed design with realistic fire truck elements and movable parts. With its small size, this toy fire truck is perfect for indoor and outdoor play. The Micro Fire Truck is built to withstand tough play and will provide hours of imaginative firefighting fun. Fuel your child's passion for firefighting and let them embark on exciting imaginary rescue missions with the Micro Fire Truck. Get ready to save the day and protect the neighborhood from imaginary fires with this thrilling toy fire truck!",
        "image_url": "https://i.ibb.co/FbCP7y3/micro-ifre-truck.jpg"
    }
]